package task01;

public class Main {
	static int a = 0xB;						//число, що відповідає номеру залікової книжки за допомогою шістнадцяткового літералу;
	static long b = 380660637568l;			//число, що відповідає номеру мобільного телефона (починаючи з 380...) за допомогою десяткового літералу;
	static byte c = 0b1000100;				//число, яке складається з останніх двох ненульових цифр номера мобільного телефону за допомогою двійкового літералу;
	static int d = 016620;					//число, яке складається з останніх чотирьох ненульових цифр номера мобільного телефону за допомогою вісімкового літералу;
	static int e = (a-1)%26 + 1;	   		//визначити збільшене на одиницю значення залишку від ділення на 26 зменшеного на одиницю номера студента в журналі групи;
	static char f = (char) e;				//символ англійського алфавіту в верхньому регістрі, номер якого відповідає знайденому раніше значенню.
	static long[] arr;
	public static void main(String[] args) {
		StringBuilder d = new StringBuilder(new String("123"));
	}
}